MCUdude/MiniCore/avr/boards.txt
##########################################################################################
## This file is created by MCUdude for use with MiniCore                                ##
## https://github.com/MCUdude/MiniCore                                                  ##
##                                                                                      ##
## This is the file where fuse settings, clock frequencies and compiler flags           ##
## are located.                                                                         ##
##                                                                                      ##
## The table below shows the available precompiled bootloaders for the corresponding    ##
## clock frequencies and baud rates. Modify the upload.speed field to change baud rate. ##
##                                                                                      ##
##  |            | 1000000 | 500000 | 250000 | 115200 | 57600 | 38400 | 19200 | 9600 |  ##
##  |------------|---------|--------|--------|--------|-------|-------|-------|------|  ##
##  | 20 MHz     |         |  X     |  X     |  X     |       |       |       |      |  ##
##  | 18.432 MHz |         |        |  X     |        |       |       |       |      |  ##
##  | 16 MHz     |  X      |  X     |  X     |  X     |       |       |       |      |  ##
##  | 12 MHz     |         |  X     |  X     |        |  X    |       |       |      |  ##
##  | 8 MHz      |         |        |  X     |  X     |  X    |  X    |  X    |      |  ##
##  | 1 MHz      |         |        |        |        |       |       |       |  X   |  ## 
##                                                                                      ##
##########################################################################################

# Menu options
menu.variant=Variant
menu.clock=Clock
menu.BOD=BOD 
menu.LTO=Compiler LTO


##########################
#### ATmega328/A/P/PA ####
##########################

328.name=ATmega328
328.upload.tool=avrdude
328.upload.protocol=arduino
328.upload.maximum_size=32256
328.upload.maximum_data_size=2048

328.bootloader.tool=avrdude
328.bootloader.unlock_bits=0x3f
328.bootloader.lock_bits=0x0f
328.bootloader.high_fuses=0xd6

328.build.core=MCUdude_corefiles
328.build.variant=standard
328.build.board=AVR_ATmega328

# Variants
328.menu.variant.modelP=328P / 328PA
328.menu.variant.modelP.build.mcu=atmega328p
328.menu.variant.modelNonP=328 / 328A
328.menu.variant.modelNonP.build.mcu=atmega328

# Brown out detection
328.menu.BOD.2v7=2.7v
328.menu.BOD.2v7.bootloader.extended_fuses=0xfd
328.menu.BOD.4v3=4.3v
328.menu.BOD.4v3.bootloader.extended_fuses=0xfc
328.menu.BOD.1v8=1.8v
328.menu.BOD.1v8.bootloader.extended_fuses=0xfe
328.menu.BOD.disabled=Disabled
328.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
328.menu.LTO.Os=Disabled (default)
328.menu.LTO.Os.compiler.c.extra_flags=
328.menu.LTO.Os.compiler.c.elf.extra_flags=
328.menu.LTO.Os.compiler.cpp.extra_flags=
328.menu.LTO.Os.ltoarcmd=avr-ar

328.menu.LTO.Os_flto=Enabled
328.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
328.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
328.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
328.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
328.menu.clock.16MHz_external=16 MHz external
328.menu.clock.16MHz_external.upload.port=UART0
328.menu.clock.16MHz_external.upload.speed=115200
328.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
328.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
328.menu.clock.16MHz_external.build.f_cpu=16000000L

328.menu.clock.20MHz_external=20 MHz external
328.menu.clock.20MHz_external.upload.port=UART0
328.menu.clock.20MHz_external.upload.speed=115200
328.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
328.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
328.menu.clock.20MHz_external.build.f_cpu=20000000L

328.menu.clock.18_432MHz_external=18.432 MHz external
328.menu.clock.18_432MHz_external.upload.port=UART0
328.menu.clock.18_432MHz_external.upload.speed=115200
328.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
328.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
328.menu.clock.18_432MHz_external.build.f_cpu=18432000L

328.menu.clock.12MHz_external=12 MHz external
328.menu.clock.12MHz_external.upload.port=UART0
328.menu.clock.12MHz_external.upload.speed=57600
328.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
328.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
328.menu.clock.12MHz_external.build.f_cpu=12000000L

328.menu.clock.8MHz_external=8 MHz external
328.menu.clock.8MHz_external.upload.port=UART0
328.menu.clock.8MHz_external.upload.speed=38400
328.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
328.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
328.menu.clock.8MHz_external.build.f_cpu=8000000L

328.menu.clock.8MHz_internal=8 MHz internal
328.menu.clock.8MHz_internal.upload.port=UART0
328.menu.clock.8MHz_internal.upload.speed=38400
328.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
328.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
328.menu.clock.8MHz_internal.build.f_cpu=8000000L

328.menu.clock.1MHz_internal=1 MHz internal
328.menu.clock.1MHz_internal.upload.port=UART0
328.menu.clock.1MHz_internal.upload.speed=9600
328.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
328.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
328.menu.clock.1MHz_internal.build.f_cpu=1000000L


##########################
#### ATmega168/A/P/PA ####
##########################

168.name=ATmega168
168.upload.tool=avrdude
168.upload.protocol=arduino
168.upload.maximum_size=15872
168.upload.maximum_data_size=1024

168.bootloader.tool=avrdude
168.bootloader.unlock_bits=0x3f
168.bootloader.lock_bits=0x0f
168.bootloader.extended_fuses=0xfc

168.build.core=MCUdude_corefiles
168.build.variant=standard
168.build.board=AVR_ATmega168

