MCUdude/MiniCore/avr/boards.txt
# Variants
168.menu.variant.modelP=168P / 168PA
168.menu.variant.modelP.build.mcu=atmega168p
168.menu.variant.modelNonP=168 / 168A
168.menu.variant.modelNonP.build.mcu=atmega168

# Brown out detection
168.menu.BOD.2v7=2.7v
168.menu.BOD.2v7.bootloader.high_fuses=0xd5
168.menu.BOD.4v3=4.3v
168.menu.BOD.4v3.bootloader.high_fuses=0xd4
168.menu.BOD.1v8=1.8v
168.menu.BOD.1v8.bootloader.high_fuses=0xd6
168.menu.BOD.disabled=Disabled
168.menu.BOD.disabled.bootloader.high_fuses=0xd7

# Compiler link time optimization
168.menu.LTO.Os=Disabled (default)
168.menu.LTO.Os.compiler.c.extra_flags=
168.menu.LTO.Os.compiler.c.elf.extra_flags=
168.menu.LTO.Os.compiler.cpp.extra_flags=
168.menu.LTO.Os.ltoarcmd=avr-ar

168.menu.LTO.Os_flto=Enabled
168.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
168.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
168.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
168.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
168.menu.clock.16MHz_external=16 MHz external
168.menu.clock.16MHz_external.upload.port=UART0
168.menu.clock.16MHz_external.upload.speed=115200
168.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
168.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.16MHz_external.build.f_cpu=16000000L

168.menu.clock.20MHz_external=20 MHz external
168.menu.clock.20MHz_external.upload.port=UART0
168.menu.clock.20MHz_external.upload.speed=115200
168.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
168.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.20MHz_external.build.f_cpu=20000000L

168.menu.clock.18_432MHz_external=18.432 MHz external
168.menu.clock.18_432MHz_external.upload.port=UART0
168.menu.clock.18_432MHz_external.upload.speed=115200
168.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
168.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.18_432MHz_external.build.f_cpu=18432000L

168.menu.clock.12MHz_external=12 MHz external
168.menu.clock.12MHz_external.upload.port=UART0
168.menu.clock.12MHz_external.upload.speed=57600
168.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
168.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.12MHz_external.build.f_cpu=12000000L

168.menu.clock.8MHz_external=8 MHz external
168.menu.clock.8MHz_external.upload.port=UART0
168.menu.clock.8MHz_external.upload.speed=38400
168.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
168.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.8MHz_external.build.f_cpu=8000000L

168.menu.clock.8MHz_internal=8 MHz internal
168.menu.clock.8MHz_internal.upload.port=UART0
168.menu.clock.8MHz_internal.upload.speed=38400
168.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
168.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.8MHz_internal.build.f_cpu=8000000L

168.menu.clock.1MHz_internal=1 MHz internal
168.menu.clock.1MHz_internal.upload.port=UART0
168.menu.clock.1MHz_internal.upload.speed=9600
168.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
168.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
168.menu.clock.1MHz_internal.build.f_cpu=1000000L


#########################
#### ATmega88/A/P/PA ####
#########################

88.name=ATmega88
88.upload.tool=avrdude
88.upload.protocol=arduino
88.upload.maximum_size=7680
88.upload.maximum_data_size=1024

88.bootloader.tool=avrdude
88.bootloader.unlock_bits=0x3f
88.bootloader.lock_bits=0x0f
88.bootloader.extended_fuses=0xfc

88.build.core=MCUdude_corefiles
88.build.variant=standard
88.build.board=AVR_ATmega88

# Variants
88.menu.variant.modelP=88P / 88PA
88.menu.variant.modelP.build.mcu=atmega88p
88.menu.variant.modelNonP=88 / 88A
88.menu.variant.modelNonP.build.mcu=atmega88

# Brown out detection
88.menu.BOD.2v7=2.7v
88.menu.BOD.2v7.bootloader.high_fuses=0xd5
88.menu.BOD.4v3=4.3v
88.menu.BOD.4v3.bootloader.high_fuses=0xd4
88.menu.BOD.1v8=1.8v
88.menu.BOD.1v8.bootloader.high_fuses=0xd6
88.menu.BOD.disabled=Disabled
88.menu.BOD.disabled.bootloader.high_fuses=0xd7

# Compiler link time optimization
88.menu.LTO.Os=Disabled (default)
88.menu.LTO.Os.compiler.c.extra_flags=
88.menu.LTO.Os.compiler.c.elf.extra_flags=
88.menu.LTO.Os.compiler.cpp.extra_flags=
88.menu.LTO.Os.ltoarcmd=avr-ar

88.menu.LTO.Os_flto=Enabled
88.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
88.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
88.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
88.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
88.menu.clock.16MHz_external=16 MHz external
88.menu.clock.16MHz_external.upload.port=UART0
88.menu.clock.16MHz_external.upload.speed=115200
88.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.16MHz_external.build.f_cpu=16000000L

88.menu.clock.20MHz_external=20 MHz external
88.menu.clock.20MHz_external.upload.port=UART0
88.menu.clock.20MHz_external.upload.speed=115200
88.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.20MHz_external.build.f_cpu=20000000L

88.menu.clock.18_432MHz_external=18.432 MHz external
88.menu.clock.18_432MHz_external.upload.port=UART0
88.menu.clock.18_432MHz_external.upload.speed=115200
88.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.18_432MHz_external.build.f_cpu=18432000L

88.menu.clock.12MHz_external=12 MHz external
88.menu.clock.12MHz_external.upload.port=UART0
88.menu.clock.12MHz_external.upload.speed=57600
88.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.12MHz_external.build.f_cpu=12000000L

