MCUdude/MiniCore/avr/boards.txt
88.menu.clock.8MHz_external=8 MHz external
88.menu.clock.8MHz_external.upload.port=UART0
88.menu.clock.8MHz_external.upload.speed=38400
88.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
88.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.8MHz_external.build.f_cpu=8000000L

88.menu.clock.8MHz_internal=8 MHz internal
88.menu.clock.8MHz_internal.upload.port=UART0
88.menu.clock.8MHz_internal.upload.speed=38400
88.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
88.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.8MHz_internal.build.f_cpu=8000000L

88.menu.clock.1MHz_internal=1 MHz internal
88.menu.clock.1MHz_internal.upload.port=UART0
88.menu.clock.1MHz_internal.upload.speed=9600
88.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
88.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
88.menu.clock.1MHz_internal.build.f_cpu=1000000L


##########################
#### ATmega48/A/P/PA ####
##########################

48.name=ATmega48 (no bootloader)
48.upload.tool= avrdude
48.upload.protocol=arduino
48.upload.maximum_size=4096
48.upload.maximum_data_size=512

48.bootloader.tool=avrdude
48.bootloader.unlock_bits=0x3f
48.bootloader.lock_bits=0x3f
48.bootloader.extended_fuses=0xff

48.build.core=MCUdude_corefiles
48.build.variant=standard
48.build.board=AVR_ATmega48

# Variants
48.menu.variant.modelP=48P / 48PA
48.menu.variant.modelP.build.mcu=atmega48p
48.menu.variant.modelNonP=48 / 48A
48.menu.variant.modelNonP.build.mcu=atmega48

# Brown out detection
48.menu.BOD.2v7=2.7v
48.menu.BOD.2v7.bootloader.high_fuses=0xd5
48.menu.BOD.4v3=4.3v
48.menu.BOD.4v3.bootloader.high_fuses=0xd4
48.menu.BOD.1v8=1.8v
48.menu.BOD.1v8.bootloader.high_fuses=0xd6
48.menu.BOD.disabled=Disabled
48.menu.BOD.disabled.bootloader.high_fuses=0xd7

# Compiler link time optimization
48.menu.LTO.Os=Disabled (default)
48.menu.LTO.Os.compiler.c.extra_flags=
48.menu.LTO.Os.compiler.c.elf.extra_flags=
48.menu.LTO.Os.compiler.cpp.extra_flags=
48.menu.LTO.Os.ltoarcmd=avr-ar

48.menu.LTO.Os_flto=Enabled
48.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
48.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
48.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
48.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
48.menu.clock.16MHz_external=16 MHz external
48.menu.clock.16MHz_external.upload.speed=115200
48.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
48.menu.clock.16MHz_external.bootloader.file=empty/empty.hex
48.menu.clock.16MHz_external.build.f_cpu=16000000L

48.menu.clock.20MHz_external=20 MHz external
48.menu.clock.20MHz_external.upload.speed=115200
48.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
48.menu.clock.20MHz_external.bootloader.file=empty/empty.hex
48.menu.clock.20MHz_external.build.f_cpu=20000000L

48.menu.clock.18_432MHz_external=18.432 MHz external
48.menu.clock.18_432MHz_external.upload.speed=115200
48.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
48.menu.clock.18_432MHz_external.bootloader.file=empty/empty.hex
48.menu.clock.18_432MHz_external.build.f_cpu=18432000L

48.menu.clock.12MHz_external=12 MHz external
48.menu.clock.12MHz_external.upload.speed=57600
48.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
48.menu.clock.12MHz_external.bootloader.file=empty/empty.hex
48.menu.clock.12MHz_external.build.f_cpu=12000000L

48.menu.clock.8MHz_external=8 MHz external
48.menu.clock.8MHz_external.upload.speed=38400
48.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
48.menu.clock.8MHz_external.bootloader.file=empty/empty.hex
48.menu.clock.8MHz_external.build.f_cpu=8000000L

48.menu.clock.8MHz_internal=8 MHz internal
48.menu.clock.8MHz_internal.upload.speed=38400
48.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
48.menu.clock.8MHz_internal.bootloader.file=empty/empty.hex
48.menu.clock.8MHz_internal.build.f_cpu=8000000L

48.menu.clock.1MHz_internal=1 MHz internal
48.menu.clock.1MHz_internal.upload.speed=9600
48.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
48.menu.clock.1MHz_internal.bootloader.file=empty/empty.hex
48.menu.clock.1MHz_internal.build.f_cpu=1000000L


###################
#### ATmega8/A ####
###################

8.name=ATmega8
8.upload.tool=avrdude
8.upload.protocol=arduino
8.upload.maximum_size=7680
8.upload.maximum_data_size=1024

8.bootloader.tool=avrdude
8.bootloader.unlock_bits=0x3f
8.bootloader.lock_bits=0x0f
8.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}

8.build.core=MCUdude_corefiles
8.build.variant=standard
8.build.board=AVR_ATmega8
8.build.mcu=atmega8

# Brown out detection - This is the first part of the low fuse bit concatenation
8.menu.BOD.2v7=2.7v
8.menu.BOD.2v7.bootloader.bod_bits=10
8.menu.BOD.4v0=4.0v
8.menu.BOD.4v0.bootloader.bod_bits=00
8.menu.BOD.disabled=Disabled
8.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
8.menu.LTO.Os=Disabled (default)
8.menu.LTO.Os.compiler.c.extra_flags=
8.menu.LTO.Os.compiler.c.elf.extra_flags=
8.menu.LTO.Os.compiler.cpp.extra_flags=
8.menu.LTO.Os.ltoarcmd=avr-ar

8.menu.LTO.Os_flto=Enabled
8.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
8.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
8.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
8.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies - This is the second part of the low fuse bit concatenation
8.menu.clock.16MHz_external=16 MHz external
8.menu.clock.16MHz_external.upload.port=UART0
8.menu.clock.16MHz_external.upload.speed=115200
8.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.16MHz_external.bootloader.high_fuses=0xc4
8.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
8.menu.clock.16MHz_external.build.f_cpu=16000000L

8.menu.clock.20MHz_external=20 MHz external
8.menu.clock.20MHz_external.upload.port=UART0
8.menu.clock.20MHz_external.upload.speed=115200
8.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.20MHz_external.bootloader.high_fuses=0xc4
8.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
8.menu.clock.20MHz_external.build.f_cpu=20000000L

8.menu.clock.18_432MHz_external=18.432 MHz external
8.menu.clock.18_432MHz_external.upload.port=UART0
8.menu.clock.18_432MHz_external.upload.speed=115200
8.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.18_432MHz_external.bootloader.high_fuses=0xc4
8.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
8.menu.clock.18_432MHz_external.build.f_cpu=18432000L

8.menu.clock.12MHz_external=12 MHz external
8.menu.clock.12MHz_external.upload.port=UART0
8.menu.clock.12MHz_external.upload.speed=57600
8.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.12MHz_external.bootloader.high_fuses=0xc4
8.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
8.menu.clock.12MHz_external.build.f_cpu=12000000L

8.menu.clock.8MHz_external=8 MHz external
8.menu.clock.8MHz_external.upload.port=UART0
8.menu.clock.8MHz_external.upload.speed=38400
8.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
8.menu.clock.8MHz_external.bootloader.high_fuses=0xc4
8.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
8.menu.clock.8MHz_external.build.f_cpu=8000000L

8.menu.clock.8MHz_internal=8 MHz internal
8.menu.clock.8MHz_internal.upload.port=UART0
8.menu.clock.8MHz_internal.upload.speed=38400
8.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
8.menu.clock.8MHz_internal.bootloader.high_fuses=0xd4
8.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
8.menu.clock.8MHz_internal.build.f_cpu=8000000L

8.menu.clock.1MHz_internal=1 MHz internal
8.menu.clock.1MHz_internal.upload.port=UART0
8.menu.clock.1MHz_internal.upload.speed=9600
8.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
8.menu.clock.1MHz_internal.bootloader.high_fuses=0xd4
8.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
8.menu.clock.1MHz_internal.build.f_cpu=1000000L

############################################################